---
type: ExternalResourceLoadContent
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ExternalResourceLoadContent

`Autodesk.Revit.DB.ExternalResourceLoadContent` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LoadStatus | 2015 | `public ExternalResourceLoadStatus LoadStatus { get ; set ; }` |
| Property | Version | 2015 | `public string Version { get ; set ; }` |